---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateRailWarn
source: html/01472603-e391-f859-e9d3-90ba1a3a1c33.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateRailWarn Property

Can't create Railing. Thickness of Rail or Balusters might be too small. If you don't want Balusters, specify "None" for Baluster Shape.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateRailWarn { get; }
```